# SetTargetElementIds Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ReferenceIntersector..::..SetTargetElementIds Method
ReferenceIntersector Class See Also
---
Sets the set of ElementIds to test from in intersection testing.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void SetTargetElementIds(
	ICollection<ElementId> elementIds
)
```

Visual Basic
---
```text
Public Sub SetTargetElementIds ( _
	elementIds As ICollection(Of ElementId) _
)
```

Visual C++
---
```text
public:
void SetTargetElementIds(
	ICollection<ElementId^>^ elementIds
)
```

# ### Parameters
elementIds
    Type: System.Collections.Generic..::..ICollection<(Of <(<'ElementId>)>)> The target ElementIds.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ReferenceIntersector Class
Autodesk.Revit.DB Namespace